## Pandas Library Usage

In [1]:
import pandas as pd

Problem Statement
1. Number of total passengers
2. Number of unique peoples (Remove duplicates)
3. Numbers of passenger survived and died, also its percentage
4. Numbers of passengers survived and died by means of group by sex, also its percentage
5. Number of passenger died as per each Pclass
6. Rearrange Name column in format "FirstName LastName", no comma
7. Number of total male and female passengers
8. Number of total male and femal passengers survived, also its percentage
9. Total fare bare by all passengers
10. Total fare distribution as per Pclass
11. Number of passenger survived and died as per each Pclass,Sex, also its percentage
12. Number of null values in each columns
13. New Dataframe with Cabin and allocated passenger name detail (i.e col1: Cabin ; col2: Name)
14. Passengers with age below 18

In [2]:
df = pd.read_csv('./titanic.csv')
print(df.shape)
print(len(df))
df.head(3)

(891, 12)
891

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### 1. Number of total passengers

In [3]:
total_passenger = df['Name'].count()
print(total_passenger)

891

#### 2. Number of unique peoples (Remove duplicates)

In [4]:
uniq = df['Name'].drop_duplicates()
uniq.shape

## Hence, as outcome received, no passengers with identical names

(891,)

#### 3. Numbers of passengers survived and died, also its percentage

In [5]:
survived = df['Survived'].value_counts()
print(survived)
print("\nPercentage survived ",round(df['Survived'].mean()*100,2))

Survived
0    549
1    342
Name: count, dtype: int64

Percentage survived  38.38

#### 4. Numbers of passengers survived and died by means of group by sex, also its percentage

In [6]:
survived = df.groupby('Sex')['Survived'].value_counts()
print(survived)
print("\nPercentage survived:\n", round(df.groupby('Sex')['Survived'].mean()*100,2))

Sex     Survived
female  1           233
        0            81
male    0           468
        1           109
Name: count, dtype: int64

Percentage survived:
 Sex
female    74.20
male      18.89
Name: Survived, dtype: float64

#### 5. Number of passenger died as per each Pclass

In [7]:
surv = (100 - df.groupby('Pclass')['Survived'].mean()*100)
print(surv)

Pclass
1    37.037037
2    52.717391
3    75.763747
Name: Survived, dtype: float64

#### 6. Rearrange Name column in format "FirstName LastName", no comma

In [8]:
def reverse_name(name):
    names = name.split(',')
    return names[1] + ' ' + names[0]

df['Reversed Name'] = df['Name'].apply(reverse_name)
df['Reversed Name']

0                                 Mr. Owen Harris Braund
1       Mrs. John Bradley (Florence Briggs Thayer) Cu...
2                                  Miss. Laina Heikkinen
3            Mrs. Jacques Heath (Lily May Peel) Futrelle
4                                Mr. William Henry Allen
                             ...
886                                 Rev. Juozas Montvila
887                          Miss. Margaret Edith Graham
888              Miss. Catherine Helen "Carrie" Johnston
889                                 Mr. Karl Howell Behr
890                                   Mr. Patrick Dooley
Name: Reversed Name, Length: 891, dtype: object

#### 7. Number of total male and female passengers

In [9]:
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

#### 8. Number of total male and femal passengers survived, also its percentage

In [10]:
sur = df.groupby('Sex')['Survived'].mean()*100
print("Survived percentage as per Sex")
print(sur)
died = (100-df.groupby('Sex')['Survived'].mean()*100)
print("Died percentage as per Sex")
print(died)

Survived percentage as per Sex
Sex
female    74.203822
male      18.890815
Name: Survived, dtype: float64
Died percentage as per Sex
Sex
female    25.796178
male      81.109185
Name: Survived, dtype: float64

#### 9. Total fare bare by all passengers

In [11]:
df['Fare'].sum()

28693.9493

#### 10. Total fare distribution as per Pclass

In [12]:
df.groupby('Pclass')['Fare'].sum()

Pclass
1    18177.4125
2     3801.8417
3     6714.6951
Name: Fare, dtype: float64

#### 11. Number of passenger survived and died as per each Pclass,Sex, also its percentage

In [13]:
surv_num = df.groupby(['Pclass','Sex'])['Survived'].value_counts()
print("Number of passengers survived and died as per Pclass and Sex")
print(surv_num)
surv = df.groupby(['Pclass','Sex'])['Survived'].mean()*100
print("\nPercentage of passengers survived and died as per Pclass and Sex")
print(surv)

Number of passengers survived and died as per Pclass and Sex
Pclass  Sex     Survived
1       female  1            91
                0             3
        male    0            77
                1            45
2       female  1            70
                0             6
        male    0            91
                1            17
3       female  0            72
                1            72
        male    0           300
                1            47
Name: count, dtype: int64

Percentage of passengers survived and died as per Pclass and Sex
Pclass  Sex
1       female    96.808511
        male      36.885246
2       female    92.105263
        male      15.740741
3       female    50.000000
        male      13.544669
Name: Survived, dtype: float64

#### 12. Number of null values in each columns

In [14]:
l1 = (list(df.columns))
for i in l1:
    print(i,df[i].isnull().sum())

PassengerId 0
Survived 0
Pclass 0
Name 0
Sex 0
Age 177
SibSp 0
Parch 0
Ticket 0
Fare 0
Cabin 687
Embarked 2
Reversed Name 0

#### 13. New Dataframe with Cabin and allocated passenger name detail (i.e col1: Cabin ; col2: Name)

In [15]:
df = df.dropna(axis=0, subset=['Cabin'])
df_new = df[['Cabin','Reversed Name']]
df_new

           Cabin                                      Reversed Name
1            C85   Mrs. John Bradley (Florence Briggs Thayer) Cu...
3           C123        Mrs. Jacques Heath (Lily May Peel) Futrelle
6            E46                             Mr. Timothy J McCarthy
10            G6                     Miss. Marguerite Rut Sandstrom
11          C103                            Miss. Elizabeth Bonnell
..           ...                                                ...
871          D35    Mrs. Richard Leonard (Sallie Monypeny) Beckwith
872  B51 B53 B55                            Mr. Frans Olof Carlsson
879          C50       Mrs. Thomas Jr (Lily Alexenia Wilson) Potter
887          B42                        Miss. Margaret Edith Graham
889         C148                               Mr. Karl Howell Behr

[204 rows x 2 columns]

#### 14. Passengers with age below 18

In [17]:
df.dropna(inplace=True)
below_18 = pd.DataFrame(df.loc[(df['Age']<18) | (df['Age'].isnull())])

name = below_18['Reversed Name']
#name
print("Number of known age passengers below age 18 are", len(name),"passengers")
print(name)

Number of known age passengers below age 18 are 19 passengers
10                        Miss. Marguerite Rut Sandstrom
183                             Master. Richard F Becker
193                            Master. Michel M Navratil
205                            Miss. Telma Matilda Strom
297                          Miss. Helen Loraine Allison
305                        Master. Hudson Trevor Allison
307     Mrs. Victor de Satode (Maria Josefa Perez de ...
329                          Miss. Jean Gertrude Hippach
340                        Master. Edmond Roger Navratil
435                             Miss. Lucile Polk Carter
445                             Master. Washington Dodge
504                                 Miss. Roberta Maioni
550                           Mr. John Borland Jr Thayer
618                           Miss. Marion Louise Becker
689                     Miss. Georgette Alexandra Madill
751                                   Master. Meier Moor
781             Mrs. Albert Adrian (Vera Gillespie) Dick
802                   Master. William Thornton II Carter
853                             Miss. Mary Conover Lines
Name: Reversed Name, dtype: object